// license
// generated from kumir version 2 1 0

void main()
{
int а = 13;
int б;

if(а = 1){
б = 1;
}

if(а = 1){б = 1;}
if(а = 2){б = 2;}
if(а = 3){б = 3;}
if(а = 4){б = 4;}
if(а = 5){б = 5;}
if(а = 6){б = 6;}
if(а = 7){б = 7;}
if(а = 8){б = 8;}
if(а = 9){б = 9;}
if(а = 10){б = 10;}

if(а = 1){б = 1;}
else {б = -1;}

if(а = 1){б = 1;}
if(а = 2){б = 2;}
if(а = 3){б = 3;}
if(а = 4){б = 4;}
if(а = 5){б = 5;}
if(а = 6){б = 6;}
if(а = 7){б = 7;}
if(а = 8){б = 8;}
if(а = 9){б = 9;}
if(а = 10){б = 10;}
else {б = -1;}

return ;
}

